Revit 2027 API
NumberSystem.ReferenceOffset Property
 The offset to the reference curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ReferenceOffset { get; set; }
Public Property ReferenceOffset As Double
	Get
	Set
public:
property double ReferenceOffset {
	double get ();
	void set (double value);
}
member ReferenceOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for referenceOffset must be no more than 30000 feet in absolute value.
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace